server/app/views/players/index.html.erb

      <td><%= link_to i.number, player_path(i) %></td>
      <td><%= unless i.channels.empty?
---
SELECT  1 AS one FROM "channels" INNER JOIN "channels_players" ON "channels"."id" = "channels_players"."channel_id" WHERE "channels_players"."player_id" = ? LIMIT 1  [["player_id", 1]]