server/app/views/players/index.html.erb

SELECT  "channels".* FROM "channels" INNER JOIN "channels_players" ON "channels"."id" = "channels_players"."channel_id" WHERE "channels_players"."player_id" = ?  ORDER BY "channels"."id" ASC LIMIT 1  [["player_id", 1]]
---
      <td><%= link_to i.number, player_path(i) %></td>
      <td><%= i.channels.first %></td>

SELECT  "channels".* FROM "channels" WHERE "channels"."id" IS NULL  ORDER BY "channels"."id" ASC LIMIT 1
---
  <%= link_to "к списку каналов", channels_path %>
  <%= link_to "channels", channel_path(Channel.where('id > 2').first) %>