server/app/controllers/api_controller.rb

SELECT  "channels".* FROM "channels" INNER JOIN "channels_players" ON "channels"."id" = "channels_players"."channel_id" WHERE "channels_players"."player_id" = ?  ORDER BY "channels"."id" ASC LIMIT 1  [["player_id", 1]]
---
  def play
    @player = Player.where(number: params[:number]).first
    @chan = @player.channels.first.link