server/app/controllers/api_controller.rb

INSERT INTO "players" ("number", "created_at", "updated_at") VALUES (?, ?, ?)  [["number", 2355], ["created_at", "2016-02-22 06:25:59.610582"], ["updated_at", "2016-02-22 06:25:59.610582"]]
SELECT  "channels".* FROM "channels" WHERE "channels"."published" = ?  ORDER BY "channels"."id" ASC LIMIT 1  [["published", "t"]]
SELECT COUNT(*) FROM "channels" WHERE "channels"."published" = ?  [["published", "t"]]
---
  def _reg
    unless @player
      @player = Player.create(number: params[:number])
      unless Channel.where(:published =>  true).empty?

SELECT  "channels".* FROM "channels" INNER JOIN "channels_players" ON "channels"."id" = "channels_players"."channel_id" WHERE "channels_players"."player_id" = ?  ORDER BY "channels"."id" ASC LIMIT 1  [["player_id", 1]]
---
  def _play
    @chan = @player.channels.first

SELECT  "channels".* FROM "channels" INNER JOIN "channels_players" ON "channels"."id" = "channels_players"."channel_id" WHERE "channels_players"."player_id" = ?  ORDER BY "channels"."id" ASC LIMIT 1  [["player_id", 1]]
SELECT  "channels".* FROM "channels" WHERE "channels"."published" = ? AND (id > 2)  ORDER BY "channels"."id" ASC LIMIT 1  [["published", "t"]]
SELECT COUNT(*) FROM "channels" WHERE "channels"."published" = ? AND (id > (i))  [["published", "t"]]
---
  def _next
    cur_chan = @player.channels.first.id
    unless Channel.where(:published =>  true).where("id > ?", cur_chan).empty?

SELECT  "channels".* FROM "channels" INNER JOIN "channels_players" ON "channels"."id" = "channels_players"."channel_id" WHERE "channels_players"."player_id" = ?  ORDER BY "channels"."id" ASC LIMIT 1  [["player_id", 1]]
SELECT  "channels".* FROM "channels" WHERE "channels"."published" = ? AND ('id' < 'i')  ORDER BY "channels"."id" ASC LIMIT 1  [["published", "t"]]
SELECT COUNT(*) FROM "channels" WHERE "channels"."published" = ? AND (id < 'i')  [["published", "t"]]
---
  def _prev
    cur_chan = @player.channels.first.id
    unless Channel.where(:published =>  true).where("id < ?", cur_chan).empty?

SELECT  "players".* FROM "players" WHERE "players"."number" = ?  ORDER BY "players"."id" ASC LIMIT 1  [["number", 54329]]
---
    def find_player
    @player = Player.where(number: params[:number]).first