server/app/controllers/channels_controller.rb

SELECT "channels".* FROM "channels" WHERE "channels"."published" = ?  [["published", "t"]]
---
  def published
    @channels = Channel.where(:published =>  true)

INSERT INTO "channels" ("name", "link", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "zxcv"], ["link", "adsfa"], ["created_at", "2016-02-20 12:14:11.201698"], ["updated_at", "2016-02-20 12:14:11.201698"]]
---
  def create
    # channel_params = (params[:channel])
    @channel = Channel.create((params[:channel]).permit(:name, :link, :published, :players))

UPDATE "channels" SET "name" = ?, "link" = ?, "updated_at" = ? WHERE "channels"."id" = ?  [["name", "asdf sdfl"], ["link", "http://live.art.cdnvideo.ru/art-pull//ed6b7e08ea/playlist.m3u8"], ["updated_at", "2016-02-20 11:53:09.902663"], ["id", 1]]
---
  def update
    # @channel = Channel.find(params[:id])
    @channel.update_attributes((params[:channel]).permit(:name, :link, :published, :players))

UPDATE "channels" SET "published" = ?, "updated_at" = ? WHERE "channels"."id" = ?  [["published", "f"], ["updated_at", "2016-02-20 13:50:13.286837"], ["id", 1]]
---
  def uppublish
    @channel.toggle!(:published)

SELECT  "channels".* FROM "channels" WHERE "channels"."id" = ?  ORDER BY "channels"."id" ASC LIMIT 1  [["id", 1]]
---
    def find_channel
      # @channel = Channel.find(params[:id])
      @channel = Channel.where(id: params[:id]).first