server/app/controllers/players_controller.rb

INSERT INTO "players" ("number", "created_at", "updated_at") VALUES (?, ?, ?)  [["number", 5555], ["created_at", "2016-02-20 18:00:33.495231"], ["updated_at", "2016-02-20 18:00:33.495231"]]
---
  def reg
    Player.create(number: params[:number]).permit(:number)

DELETE FROM "channels" WHERE "channels"."id" = ?  [["id", 1]]
SELECT  "channels".* FROM "channels" WHERE "channels"."published" = ?  ORDER BY "channels"."id" ASC LIMIT 1  [["published", "t"]]
SELECT COUNT(*) FROM "channels" WHERE "channels"."published" = ?  [["published", "t"]]
---
  def fix
    @player.channels.clear
    unless Channel.where(:published =>  true).empty?

SELECT  "channels".* FROM "channels" INNER JOIN "channels_players" ON "channels"."id" = "channels_players"."channel_id" WHERE "channels_players"."player_id" = ?  ORDER BY "channels"."id" ASC LIMIT 1  [["player_id", 1]]
---
  def play
    @chan = @player.channels.first.link

INSERT INTO "players" ("number", "created_at", "updated_at") VALUES (?, ?, ?)  [["number", 2354], ["created_at", "2016-02-20 16:21:06.681109"], ["updated_at", "2016-02-20 16:21:06.681109"]]
SELECT  1 AS one FROM "players" WHERE "players"."number" IS NULL LIMIT 1
---
  def create
    @player = Player.create((params[:player]).permit(:number, :channels))

    if @player.errors.empty?

SELECT  "players".* FROM "players" WHERE "players"."id" = ?  ORDER BY "players"."id" ASC LIMIT 1  [["id", 3]]
---
    def find_player
    @player = Player.where(id: params[:id]).first