server/app/views/channels/index.html.erb

      <td><%= i.published %>, <%= link_to "изменить", uppublish_channel_path(i) %></td>
      <td><%= link_to i.players.count, channel_path(i) %></td>
---
SELECT COUNT(*) FROM "players" INNER JOIN "channels_players" ON "players"."id" = "channels_players"."player_id" WHERE "channels_players"."channel_id" = ?  [["channel_id", 2]]