server/app/views/channels/show.html.erb

SELECT  1 AS one FROM "players" INNER JOIN "channels_players" ON "players"."id" = "channels_players"."player_id" WHERE "channels_players"."channel_id" = ? LIMIT 1  [["channel_id", 2]]
SELECT "players".* FROM "players" INNER JOIN "channels_players" ON "players"."id" = "channels_players"."player_id" WHERE "channels_players"."channel_id" = ?  [["channel_id", 2]]
---
</ul>
<% if @channel.players.empty? %>